spec/dump/ccu1.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:ns1="http://www.akamai.com/purge"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
                   SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <SOAP-ENV:Body>
    <ns1:purgeRequest>
      <name xsi:type="xsd:string">sample</name>
      <pwd xsi:type="xsd:string">sample</pwd>
      <network xsi:type="xsd:string"></network>
      <opt SOAP-ENC:arrayType="xsd:string[0]" xsi:type="ns1:ArrayOfString">
          <item xsi:type="xsd:string">key1=value1</item>
          <item xsi:type="xsd:string">key2=value2</item>
      </opt>
      <uri SOAP-ENC:arrayType="xsd:string[1]" xsi:type="ns1:ArrayOfString">
          <item xsi:type="xsd:string">uri1</item>
          <item xsi:type="xsd:string">uri2</item>
      </uri>
    </ns1:purgeRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
